// /processors/messages/sendMenu.mjs

import { config } from '../../../config.mjs'
import hasMatchingKeywords from '../../utils/hasMatchingKeywords.mjs';
import logger from '../../utils/logger.mjs'

export async function sendMenu(message, messageMeta) {
    try {
        const keywords = ["!قائمة", "!قائمه", "!القائمة", "!القائمه", "!menu", '!list'];
        if (!hasMatchingKeywords(message.body, keywords)) return

        // بداية الرسالة
        let menuText = `مرحباً ${messageMeta.pushname}! إليك قائمة الأوامر المتاحة:\n\n`;

        // 📌 قسم الملصقات
        menuText += `🖼 *أوامر الملصقات والميديا:*\n`;
        menuText += `1. *!ملصق*: لتحويل صورة أو فيديو إلى ملصق.\n`;
        menuText += `2. *!خلفية*: لإزالة الخلفية من الصورة.\n`;
        menuText += `3. *!دائرة*: لتحويل الصورة إلى شكل دائرة مع خلفية شفافة.\n`;
        menuText += `4. *!إرجاع*: لتحويل الملصق إلى صورة أو فيديو.\n`;
        menuText += `5. *!اسرق*: لسرقة الملصقات.\n`;
        menuText += `6. *!كتابة [رقم-النمط]*: إنشاء ملصق نصي بـ 10 أنماط فنية (مثال: !كتابة3 مرحباً).\n`;
        menuText += `7. *!صورة [رقم-النمط]*: تحويل صورة إلى ملصق مع نص بـ 10 أنماط فنية (مثال: !صورة5 مرحباً).\n`;
        menuText += `8. *!رقمي*: لإنشاء ملصق برقم الهاتف الخاص بك.\n`;
        menuText += `9. *!صلاة*: يرسل ملصق بوقت الصلاة القادمة بتوقيت مكة المكرمة.\n`;
        menuText += `10. *!تاريخ*: يرسل ملصق يحتوي على التاريخ الهجري والميلادي الحالي.\n`;
        menuText += `11. *!توقيع [النص]*: لإنشاء ملصق توقيع مميز بـ *5 أنماط مختلفة* (مثال: !توقيع4 فلان الفلاني).\n`;
        menuText += `12. *!فيديو [النص]*: لإنشاء ملصق متحرك مع نص (مثال: !فيديو مرحبا بالجميع).\n\n`;

        // 📌 قسم الأوامر الأخرى
        menuText += `🔹 *أوامر أخرى:*\n`;
        menuText += `13. *!سؤال*: لطرح سؤال إسلامي بشكل عشوائي في جميع المجالات.\n`;
        menuText += `14. *!إجابة*: للرد على السؤال ومعرفة الإجابة.\n`;
        menuText += `15. *!صوت [1-15]*: لتطبيق تأثير صوتي على ملف صوتي أو فيديو.\n`;
        menuText += `16. *!تقويم*: للحصول على التقويم الهجري والميلادي لهذا اليوم.\n\n`;

        // ملاحظات هامة
        menuText += `📌 *ملاحظات هامة:*\n\n`;
        menuText += `- جودة الفيديو: يتم اقتصاص أول 7 ثواني تلقائياً.\n\n`;
        menuText += `*لأوامر الميديا (!ملصق، !دائرة، !خلفية):*\n`;
        menuText += `- أرسل الصورة/الفيديو مع كتابة الأمر في _وصف الميديا_.\n`;
        menuText += `- أو أرسل الأمر كـ *رد على الرسالة* المراد تحويلها.\n\n`;

        // إضافة الرسالة الختامية
        menuText += `اختر الأمر الذي تود استخدامه! 😄`;

        // إرسال الرسالة
        return await message.reply(menuText);
    } catch (error) {
        logger.error('Error sending menu response:', error);
    }
}